[
  {
    "id": "0-Cauldron",
    "number": "0",
    "suit": "Cauldron",
    "fullTitle": "0 Cauldron - The Cauldron of Creation",
    "symbols": [
      { "key": "Number", "value": "0" },
      { "key": "Suit", "value": "Cauldron" },
      { "key": "Element (Base)", "value": "Water" },
      {
        "key": "Planet (Internal Influence)",
        "value": "Pluto – deep, transformative forces working behind the scenes."
      },
      { "key": "Astrology (External Domain)", "value": "Scorpio – rebirth, secrecy, and shedding of old layers." },
      { "key": "Icon", "value": "Cauldron" },
      { "key": "Orientation", "value": "Cooking" },
      { "key": "Sacred Geometry", "value": "Dot" },
      { "key": "Synergistic Element", "value": "Fire" }
    ],
    "symbolismBreakdown": [
      "Orientation (Cooking): Indicates that the creation is in progress, not yet released. This highlights a phase of internal development, gestation, and careful preparation, where the transformative work is happening beneath the surface, shielded from external view until ready.",
      "Sacred Geometry (Dot): The spark of origin—the first point from which all things emerge. It is the singularity, the concentrated seed of potential, the initial impulse of consciousness before expansion into dimension and form. A symbol of unity and wholeness.",
      "Planet (Pluto): Deep, transformative forces working behind the scenes. Pluto governs the subconscious realms, instigating profound metamorphosis by unearthing hidden truths, dismantling old structures, and facilitating regeneration and rebirth from the ashes of what was.",
      "Astrology (Scorpio): Reflects external themes of rebirth, secrecy, and shedding of old layers. Scorpio navigates the depths of existence, confronting power dynamics, intense emotions, and the mysteries of life and death, ultimately leading to profound healing and empowerment.",
      "Synergistic Element (Fire): The combustion of Spirit and Water—the ignition of creation and passion. Fire is the activating, dynamic principle that fuels transformation, provides courage, and illuminates the path, turning inspiration (Spirit) and emotional depth (Water) into tangible manifestation."
    ],
    "keyMeanings": [
      "Creation in Progress: Energy is stirring, but not yet ready to emerge. This signifies a nascent stage where potential is palpable but requires further nurturing and internal development before it can be fully expressed or witnessed externally.",
      "Alchemy and Transformation: Inner metamorphosis is occurring beneath the surface. Like the alchemical process of turning lead into gold, this points to profound internal shifts, healing, and the integration of disparate parts of oneself into a more evolved state."
    ],
    "baseElement": "Water",
    "planetExternalDomain": "Pluto – deep transformation, subconscious forces.",
    "astrologyInternalInfluence": "Scorpio – rebirth, secrecy, shedding old layers.",
    "iconSymbol": "cauldron",
    "orientation": "Cooking",
    "sacredGeometry": "Dot",
    "synergisticElement": "Fire"
  },
  {
    "id": "1-Cauldron",
    "number": "1",
    "suit": "Cauldron",
    "fullTitle": "1 Cauldron - The Cauldron of Manifestation",
    "symbols": [
      { "key": "Number", "value": "1" },
      { "key": "Suit", "value": "Cauldron" },
      { "key": "Element (Base)", "value": "Water" },
      { "key": "Planet (External Domain)", "value": "Sun – vitality, self-expression, conscious will." },
      { "key": "Astrology (Internal Influence)", "value": "Leo – creativity, leadership, inner radiance." },
      { "key": "Icon", "value": "cauldron" },
      { "key": "Orientation", "value": "Upright" },
      { "key": "Sacred Geometry", "value": "Circle" },
      { "key": "Synergistic Element", "value": "Fire" }
    ],
    "symbolismBreakdown": [
      "Number: 1 – New beginnings, individuality, leadership. Represents the initial spark, the self, and the drive to create. It signifies a fresh start and the power of focused intention.",
      "Suit (Cauldron): The vessel of transformation, creation, and spiritual nourishment. The cauldron symbolizes the womb of creation, where disparate elements are combined and transformed into something new and potent.",
      "Icon (Cauldron): A symbol of creation, transformation, and spiritual nourishment. It represents the alchemical process of turning raw potential into manifest reality.",
      "Orientation (Upright): Active manifestation, clear intention. The cauldron is stable and ready to receive or pour forth, indicating that the creative energies are flowing freely and purposefully.",
      "Sacred Geometry (Circle): Wholeness, unity, infinite potential. The circle represents completion, the cycle of life, and the boundless nature of creation. It signifies a contained and perfect form.",
      "Planet (Sun): The source of vitality, self-expression, and conscious will. The Sun illuminates, brings life, and represents the core self, encouraging bold and authentic creation.",
      "Astrology (Leo): Reflects themes of creativity, leadership, and inner radiance. Leo embodies the courage to express oneself, to lead with heart, and to shine brightly in one's endeavors.",
      "Synergistic Element (Fire): The activating, dynamic principle that fuels transformation, provides courage, and illuminates the path, turning inspiration (Spirit) and emotional depth (Water) into tangible manifestation."
    ],
    "keyMeanings": [
      "New Beginnings: A powerful impulse to create and manifest. This signifies the start of a new cycle, project, or phase where your creative energies are at their peak, ready to bring something new into existence.",
      "Creative Power: The ability to shape your reality through conscious will. You possess the inner fire and vision to transform ideas into tangible forms, requiring focused intention and self-expression.",
      "Self-Expression: Authentically bringing your inner vision to life. This card encourages you to express your unique essence and creative spirit without reservation, allowing your true self to shine through your creations.",
      "Leadership in Creation: Taking charge of your creative process. You are called to lead your own initiatives, guiding them with confidence and a clear sense of purpose, inspiring others through your example.",
      "Vitality and Purpose: Infusing your creations with life force and meaning. Your work is not just about making something, but imbuing it with your spirit and a deep sense of purpose, making it truly alive."
    ],
    "baseElement": "Water",
    "planetExternalDomain": "Sun – vitality, self-expression, conscious will.",
    "astrologyInternalInfluence": "Leo – creativity, leadership, inner radiance.",
    "iconSymbol": "cauldron",
    "orientation": "Upright",
    "sacredGeometry": "Circle",
    "synergisticElement": "Fire"
  },
  {
    "id": "2-Sword",
    "number": "2",
    "suit": "Sword",
    "fullTitle": "2 Sword - The Sword of Discernment",
    "symbols": [
      { "key": "Number", "value": "2" },
      { "key": "Suit", "value": "Sword" },
      { "key": "Element (Base)", "value": "Air" },
      { "key": "Planet (External Domain)", "value": "Moon – reflective depth, changeability, emotional navigation." },
      { "key": "Astrology (Internal Influence)", "value": "Cancer – emotional awareness, outer security, nurturing." },
      { "key": "Icon", "value": "sword" },
      { "key": "Orientation", "value": "Point First" },
      { "key": "Sacred Geometry", "value": "Delta" },
      { "key": "Synergistic Element", "value": "Water" }
    ],
    "symbolismBreakdown": [
      "Number: 2 – Balance, duality, choice. Represents partnership, cooperation, and the need for decision-making. It signifies a crossroads or a need to weigh options.",
      "Suit (Sword): The tool of intellect, truth, and discernment. The sword symbolizes mental clarity, the ability to cut through illusion, and the power of precise thought and communication.",
      "Icon (Sword): A symbol of intellect, truth, and discernment. It represents the ability to cut through confusion and arrive at clarity.",
      "Orientation (Point First): Direct focus, clear intention. The sword is aimed, indicating a need for precise thought and a clear direction in mental matters.",
      "Sacred Geometry (Delta): The triangle, representing balance, harmony, and the integration of mind, body, and spirit. It signifies a stable foundation for decision-making.",
      "Planet (Moon): Reflective depth, changeability, and emotional navigation. The Moon governs intuition, the subconscious, and the ebb and flow of emotions. Its influence encourages introspection and listening to inner guidance.",
      "Astrology (Cancer): Emotional awareness applied to outer security and nurturing. Cancer emphasizes the need for a secure emotional foundation, using intuition to protect and care for oneself and others. It brings a sensitive, empathetic quality to perception.",
      "Synergistic Element (Water): Water enhances the sword's clarity by infusing emotional depth into logical discernment, allowing intuition to guide precise thought. This creates a balance where intellect is informed by empathy, leading to more holistic understanding."
    ],
    "keyMeanings": [
      "Focused Awareness: Seeing clearly without reacting impulsively. This calls for keen observation and understanding of a situation before taking action, using both intellect and intuition to perceive the truth.",
      "Emotional Intelligence: Understanding one's own and others' inner worlds. It is the ability to recognize, understand, and manage your own emotions, and to understand and influence the emotions of others, leading to better decisions.",
      "Hesitation with Purpose: Listening and weighing choices before action. This is not procrastination, but a deliberate pause to ensure that any decision made is well-informed, balanced, and aligned with deeper intuitive knowing.",
      "Mental Alignment: The mind aligning with emotional intuition. True clarity comes when logical thought processes are harmonized with the wisdom of feelings, leading to choices that are both sound and soulful."
    ],
    "baseElement": "Air",
    "planetExternalDomain": "Moon – reflective depth, changeability, emotional navigation.",
    "astrologyInternalInfluence": "Cancer – protection, emotional depth, caregiving.",
    "iconSymbol": "Delta",
    "orientation": "Point First",
    "sacredGeometry": "Delta",
    "synergisticElement": "Water"
  },
  {
    "id": "3-Cord",
    "number": "3",
    "suit": "Cord",
    "fullTitle": "3 Cord - The Cord of Connection",
    "symbols": [
      { "key": "Number", "value": "3" },
      { "key": "Suit", "value": "Cord" },
      { "key": "Element (Base)", "value": "Spirit" },
      { "key": "Planet (External Domain)", "value": "Venus – harmony, relationships, values." },
      { "key": "Astrology (Internal Influence)", "value": "Libra – balance, partnership, inner justice." },
      { "key": "Icon", "value": "cord" },
      { "key": "Orientation", "value": "Tied" },
      { "key": "Sacred Geometry", "value": "Triangle" },
      { "key": "Synergistic Element", "value": "Air" }
    ],
    "symbolismBreakdown": [
      "Number: 3 – Growth, creativity, communication. Represents expansion, synthesis, and the bringing together of different elements to form a new whole.",
      "Suit (Cord): The binding of fate, connection, and destiny. The cord symbolizes the threads that connect individuals, events, and spiritual paths, representing relationships, commitments, and the weaving of life's tapestry.",
      "Icon (Cord): A symbol of connection, binding, and destiny. It represents the threads that weave through life, connecting people, events, and spiritual paths.",
      "Orientation (Tied): Established connection, commitment. The knot signifies a bond, a decision made, or a relationship solidified, indicating a strong and purposeful link.",
      "Sacred Geometry (Triangle): Harmony, balance, and the integration of mind, body, and spirit. The triangle represents a stable and dynamic structure, symbolizing the union of opposing forces.",
      "Planet (Venus): Harmony, relationships, and values. Venus governs love, beauty, and connection, influencing how we relate to others and what we value in our interactions.",
      "Astrology (Libra): Reflects themes of balance, partnership, and inner justice. Libra seeks equilibrium in relationships, emphasizing fairness, cooperation, and the harmonious integration of different perspectives.",
      "Synergistic Element (Air): Air enhances the cord's connection by bringing clarity, communication, and intellectual understanding to relationships. It allows for open dialogue and the free exchange of ideas, strengthening bonds through shared thought."
    ],
    "keyMeanings": [
      "Harmonious Connections: Relationships are forming or strengthening. This signifies a period of positive interactions, partnerships, and the weaving of new bonds, emphasizing mutual understanding and shared values.",
      "Creative Collaboration: Bringing ideas together for a shared purpose. This points to successful teamwork, where diverse perspectives merge to create something greater than the sum of its parts, fostering innovation and growth.",
      "Balanced Reciprocity: Giving and receiving in equal measure. This highlights the importance of fairness and equilibrium in all exchanges, ensuring that relationships are mutually beneficial and sustainable.",
      "Spiritual Alignment: Connecting with your higher purpose and others. This suggests that your relationships and collaborations are aligned with your spiritual path, bringing a sense of deeper meaning and fulfillment.",
      "Commitment and Trust: Solidifying bonds through shared values. This card encourages building trust and committing to relationships that support your growth and bring harmony into your life."
    ],
    "baseElement": "Spirit",
    "planetExternalDomain": "Venus – harmony, relationships, values.",
    "astrologyInternalInfluence": "Libra – balance, partnership, inner justice.",
    "iconSymbol": "cord",
    "orientation": "Tied",
    "sacredGeometry": "Triangle",
    "synergisticElement": "Air"
  },
  {
    "id": "4-Spear",
    "number": "4",
    "suit": "Spear",
    "fullTitle": "4 Spear - The Spear of Drive and Direction",
    "symbols": [
      { "key": "Number", "value": "4" },
      { "key": "Suit", "value": "Spear" },
      { "key": "Element (Base)", "value": "Earth" },
      { "key": "Planet (External Domain)", "value": "Uranus – revolution, innovation, and personal awakening." },
      {
        "key": "Astrology (Internal Influence)",
        "value": "Aquarius – humanitarian focus, idealism, breaking tradition."
      },
      { "key": "Icon", "value": "Direction Arrows" },
      { "key": "Orientation", "value": "Shaft First" },
      { "key": "Sacred Geometry", "value": "Ladder" },
      { "key": "Synergistic Element", "value": "Air" }
    ],
    "symbolismBreakdown": [
      "Number: 4 – Stability, foundation, structure. Represents order, discipline, and the building of solid groundwork. It signifies practicality and the establishment of a secure base.",
      "Suit (Spear): The tool of drive, direction, and purpose. The spear symbolizes focused intention, the pursuit of goals, and the power to penetrate obstacles and achieve objectives.",
      "Icon (Direction Arrows): A symbol of clear purpose, movement, and progress. It represents the ability to set a course and move forward with determination.",
      "Orientation (Shaft First): Grounded action, practical application. The spear is held firmly, indicating a readiness to act with precision and a clear understanding of the task at hand.",
      "Sacred Geometry (Ladder): Ascent, progress, and connection between realms. The ladder symbolizes a path of growth, step-by-step advancement, and the bridging of different levels of understanding or being.",
      "Planet (Uranus): Revolution, innovation, and personal awakening. Uranus brings sudden changes, breakthroughs, and a desire for freedom and originality, often leading to new directions and unconventional paths.",
      "Astrology (Aquarius): Reflects themes of humanitarian focus, idealism, breaking tradition. Aquarius embodies a forward-thinking approach, a commitment to collective well-being, and a willingness to challenge established norms for progress.",
      "Synergistic Element (Air): Fire combined with Air creates movement, clarity, and momentum. Air (intellect, communication) fans the flames of Fire (action, drive), providing strategic thinking and clear articulation to propel initiatives forward. (Note: Element (Base) is Earth, Synergistic is Air, with Fire mentioned. The core idea is Air's contribution to drive.)"
    ],
    "keyMeanings": [
      "Drive With Vision: Structured energy moving toward an ideal. This combines passionate motivation with a clear, well-defined goal and a practical plan, ensuring that effort is applied effectively and purposefully.",
      "Foundation for Action: Building what will carry the force forward. Before launching an initiative, it's crucial to establish a stable base, gather resources, and create the necessary support structures to sustain momentum.",
      "Revolutionary Roots: A new direction built on idealism and truth. This encourages breaking from outdated norms if necessary, guided by a strong sense of purpose and a commitment to authentic, progressive ideals.",
      "Strategic Advancement: A call to ground your inspiration into method. Inspiration needs a practical plan. This is about transforming visionary ideas into actionable steps and methodical execution to achieve tangible results."
    ],
    "baseElement": "Earth",
    "planetExternalDomain": "Uranus – revolution, innovation, and personal awakening.",
    "astrologyInternalInfluence": "Aquarius – humanitarian focus, idealism, breaking tradition.",
    "iconSymbol": "Direction Arrows",
    "orientation": "Shaft First",
    "sacredGeometry": "Ladder",
    "synergisticElement": "Air"
  },
  {
    "id": "5-Sword",
    "number": "5",
    "suit": "Sword",
    "fullTitle": "5 Sword - The Sword of Power and Conflict",
    "symbols": [
      { "key": "Number", "value": "5" },
      { "key": "Suit", "value": "Sword" },
      { "key": "Element (Base)", "value": "Air" },
      { "key": "Planet (External Domain)", "value": "Mars – assertion, willpower, protection." },
      { "key": "Astrology (Internal Influence)", "value": "Aries – direct action, courage, leadership." },
      { "key": "Icon", "value": "sword" },
      { "key": "Orientation", "value": "Point Down" },
      { "key": "Sacred Geometry", "value": "Pentagon" },
      { "key": "Synergistic Element", "value": "Fire" }
    ],
    "symbolismBreakdown": [
      "Number: 5 – Change, instability, freedom. Represents disruption, challenge, and the need for adaptation. It signifies a turning point or a period of dynamic shifts.",
      "Suit (Sword): The tool of intellect, truth, and discernment. The sword symbolizes mental clarity, the ability to cut through illusion, and the power of precise thought and communication.",
      "Icon (Sword): A symbol of intellect, truth, and discernment. It represents the ability to cut through confusion and arrive at clarity.",
      "Orientation (Point Down): Grounded power, inner conflict. The sword is directed inward or towards the earth, indicating a need to confront internal struggles or to ground one's mental energy.",
      "Sacred Geometry (Pentagon): Protection, balance of elements, human will. The pentagon symbolizes the five elements in harmony, representing strength, resilience, and the power of human intention.",
      "Planet (Mars): Assertion, willpower, and protection. Mars governs drive, aggression, and courage, influencing how we assert ourselves and defend our boundaries.",
      "Astrology (Aries): Reflects themes of direct action, courage, and leadership. Aries initiates with boldness, embodying the drive to confront challenges head-on and lead with conviction.",
      "Synergistic Element (Fire): Fire enhances the sword's power by infusing it with passion, courage, and the drive to overcome obstacles. It provides the energy needed to assert truth and engage in necessary conflict."
    ],
    "keyMeanings": [
      "Confronting Conflict: A challenge requires direct engagement. This signifies a period where you must face disagreements or internal struggles head-on, using your intellect and courage to navigate the situation.",
      "Asserting Truth: Speaking your mind with conviction. This calls for honesty and direct communication, even if it leads to confrontation, to establish clear boundaries and uphold your values.",
      "Inner Battle: Resolving internal contradictions or doubts. This points to a need for self-reflection and mental clarity to overcome personal obstacles and align your thoughts with your true will.",
      "Strategic Action: Planning your moves with precision. This encourages a thoughtful approach to conflict, where you use your intellect to strategize and execute actions that lead to resolution and empowerment.",
      "Protecting Boundaries: Defending your space and beliefs. This emphasizes the importance of setting clear limits and protecting your energy from external pressures, ensuring your mental and emotional well-being."
    ],
    "baseElement": "Air",
    "planetExternalDomain": "Mars – assertion, willpower, protection.",
    "astrologyInternalInfluence": "Aries – direct action, courage, leadership.",
    "iconSymbol": "pentagon",
    "orientation": "Point Down",
    "sacredGeometry": "Pentagon",
    "synergisticElement": "Fire"
  },
  {
    "id": "6-Stone",
    "number": "6",
    "suit": "Stone",
    "fullTitle": "6 Stone - The Stone of Harmony and Healing",
    "symbols": [
      { "key": "Number", "value": "6" },
      { "key": "Suit", "value": "Stone" },
      { "key": "Element (Base)", "value": "Earth" },
      { "key": "Planet (External Domain)", "value": "Jupiter – expansion, purpose, trust in time." },
      {
        "key": "Astrology (Internal Influence)",
        "value": "Sagittarius – truth-seeking, life journey, philosophical freedom."
      },
      { "key": "Icon", "value": "Hourglass" },
      { "key": "Orientation", "value": "Knot Before" },
      { "key": "Sacred Geometry", "value": "Finite Symbol" },
      { "key": "Synergistic Element", "value": "Spirit" }
    ],
    "symbolismBreakdown": [
      "Number: 6 – Harmony, balance, responsibility. Represents nurturing, service, and the pursuit of perfection. It signifies domesticity, community, and the need for equilibrium.",
      "Suit (Stone): The physical, ritual witness, the stone of remembrance. The stone here acts as a monument to what has been experienced and learned, a tangible marker of the journey's end and the wisdom consolidated.",
      "Icon (Hourglass): A symbol of time, cycles, and the finite nature of existence. It represents the passage of time, the importance of the present moment, and the cyclical nature of life.",
      "Orientation (Knot Before): Suggests the binding is imminent—preparation for conclusion. A knot tied signifies commitment, a decision made, or a process being secured. 'Knot Before' implies the final actions leading up to this sealing.",
      "Sacred Geometry (Finite Symbol): The edge of infinity-what is bounded must resolve. This likely refers to a symbol representing a closed loop or a defined boundary (perhaps the infinity symbol itself, representing cycles), indicating that within any given framework, resolution or completion is sought.",
      "Planet (Jupiter): Inner expansion through boundaries and endings. Jupiter brings growth, optimism, and a search for meaning. Even as a cycle concludes, Jupiter's influence ensures that this ending paves the way for greater understanding and future opportunities.",
      "Astrology (Sagittarius): Reflects themes of truth-seeking mission concluding a cycle. Sagittarius is associated with exploration, higher learning, and a quest for truth. This indicates that a particular journey of discovery or understanding is reaching a point of culmination.",
      "Synergistic Element (Spirit): Earth giving rise to release and ascension. Spirit here connects to the ethereal, the transcendent. As the earthly cycle (represented by the cord and its binding) completes, there's an opportunity for a release of energy or understanding to a higher level. (Note: Original text says Earth, but Synergistic Element is Spirit; assuming Spirit is the intended focus here for ascension concept)."
    ],
    "keyMeanings": [
      "Countdown to Release: A lesson or binding is reaching its final moment. There's a sense of anticipation as a period of learning, commitment, or a particular situation approaches its defined end, preparing for a transition.",
      "Truth Before Binding: A need to recognize what must be seen before closure. Before a cycle is fully completed or a commitment sealed, it's crucial to acknowledge all relevant truths and insights gained.",
      "Purpose Realized: The result of your actions must be accepted. The efforts and choices made within this cycle are now culminating, and it's time to own the outcomes, learning from them for future growth.",
      "Time's End: A cycle completes, but a journey continues inward. While an external phase may be finishing, the internal process of integration, learning, and spiritual development carries on, often deepened by the experience."
    ],
    "baseElement": "Fire",
    "planetExternalDomain": "Jupiter – expansion, purpose, trust in time.",
    "astrologyInternalInfluence": "Sagittarius – truth-seeking, life journey, philosophical freedom.",
    "iconSymbol": "Hourglass",
    "orientation": "Knot Before",
    "sacredGeometry": "Finite Symbol",
    "synergisticElement": "Spirit"
  },
  {
    "id": "7-Spear",
    "number": "7",
    "suit": "Spear",
    "fullTitle": "7 Spear - The Spear of Insight and Strategy",
    "symbols": [
      { "key": "Number", "value": "7" },
      { "key": "Suit", "value": "Spear" },
      { "key": "Element (Base)", "value": "Air" },
      { "key": "Planet (External Domain)", "value": "Neptune – intuition, spirituality, illusion." },
      { "key": "Astrology (Internal Influence)", "value": "Pisces – empathy, spiritual connection, inner wisdom." },
      { "key": "Icon", "value": "Spear" },
      { "key": "Orientation", "value": "Point Up" },
      { "key": "Sacred Geometry", "value": "Star" },
      { "key": "Synergistic Element", "value": "Water" }
    ],
    "symbolismBreakdown": [
      "Number: 7 – Spirituality, introspection, wisdom. Represents inner knowing, solitude, and the search for deeper truths. It signifies a period of reflection and spiritual growth.",
      "Suit (Spear): The tool of drive, direction, and purpose. The spear symbolizes focused intention, the pursuit of goals, and the power to penetrate obstacles and achieve objectives.",
      "Icon (Spear): A symbol of focused intention, penetration, and clarity. It represents the ability to cut through illusion and gain deep insight.",
      "Orientation (Point Up): Spiritual aspiration, higher purpose. The spear is directed towards the heavens, indicating a focus on spiritual growth, divine guidance, and higher ideals.",
      "Sacred Geometry (Star): Divine guidance, spiritual connection, and cosmic order. The star symbolizes enlightenment, inspiration, and the alignment with universal truths.",
      "Planet (Neptune): Intuition, spirituality, and illusion. Neptune governs dreams, mysticism, and the subconscious, influencing our connection to the divine and our ability to perceive beyond the material.",
      "Astrology (Pisces): Reflects themes of empathy, spiritual connection, and inner wisdom. Pisces embodies compassion, a deep understanding of the unseen, and a profound connection to universal consciousness.",
      "Synergistic Element (Water): Water enhances the spear's insight by infusing it with intuition, emotional depth, and spiritual understanding. It allows for a more fluid and empathetic approach to truth-seeking and strategic planning."
    ],
    "keyMeanings": [
      "Deep Insight: Uncovering hidden truths through intuition. This signifies a period of profound understanding, where you gain clarity by looking beyond the surface and trusting your inner wisdom.",
      "Spiritual Guidance: Receiving messages from higher realms. This calls for openness to spiritual insights and a willingness to listen to your intuition, guiding you towards your true path.",
      "Strategic Clarity: Developing a clear plan based on inner knowing. This encourages a thoughtful approach to challenges, where your actions are guided by deep understanding and a sense of divine purpose.",
      "Transcending Illusion: Seeing through deception and confusion. This points to a need to discern truth from illusion, trusting your inner compass to navigate complex situations and avoid pitfalls.",
      "Empathic Direction: Guiding others with compassion and wisdom. This emphasizes the importance of using your insights not just for yourself, but to help others find their way, offering guidance with empathy and understanding."
    ],
    "baseElement": "Air",
    "planetExternalDomain": "Neptune – intuition, spirituality, illusion.",
    "astrologyInternalInfluence": "Pisces – empathy, spiritual connection, inner wisdom.",
    "iconSymbol": "Spear",
    "orientation": "Point Up",
    "sacredGeometry": "Star",
    "synergisticElement": "Water"
  },
  {
    "id": "8-Cord",
    "number": "8",
    "suit": "Cord",
    "fullTitle": "8 Cord - The Cord of Karma and Responsibility",
    "symbols": [
      { "key": "Number", "value": "8" },
      { "key": "Suit", "value": "Cord" },
      { "key": "Element (Base)", "value": "Spirit" },
      {
        "key": "Planet (External Domain)",
        "value": "Saturn – responsibility, karmic patterns, mastery through boundaries."
      },
      { "key": "Astrology (Internal Influence)", "value": "Capricorn – structure, long-term goals, integrity." },
      { "key": "Icon", "value": "Hourglass" },
      { "key": "Orientation", "value": "Knot Away" },
      { "key": "Sacred Geometry", "value": "Infinity Symbol" },
      { "key": "Synergistic Element", "value": "Spirit" }
    ],
    "symbolismBreakdown": [
      "Number: 8 – Abundance, power, karma. Represents material success, authority, and the consequences of actions. It signifies balance between the spiritual and material worlds.",
      "Suit (Cord): The binding of fate, connection, and destiny. The cord symbolizes the threads that connect individuals, events, and spiritual paths, representing relationships, commitments, and the weaving of life's tapestry.",
      "Icon (Hourglass): A symbol of time, cycles, and the finite nature of existence. It represents the passage of time, the importance of the present moment, and the cyclical nature of life.",
      "Orientation (Knot Away): Release, completion, letting go. The knot is untying or moving away, indicating a process of liberation, the completion of a cycle, or the release of old commitments.",
      "Sacred Geometry (Infinity Symbol): Eternal cycles, balance, and interconnectedness. The infinity symbol represents endless possibilities, the flow of energy, and the continuous nature of existence.",
      "Planet (Saturn): Responsibility, karmic patterns, and mastery through boundaries. Saturn governs discipline, structure, and the lessons learned through challenges, influencing our ability to build lasting foundations.",
      "Astrology (Capricorn): Reflects themes of structure, long-term goals, integrity. Capricorn embodies discipline, ambition, and a commitment to building a solid future through hard work and ethical conduct.",
      "Synergistic Element (Spirit): Spirit enhances the cord's karmic influence by bringing a higher perspective to responsibility, allowing for understanding of life's cycles and the wisdom gained from experience. It facilitates release and ascension."
    ],
    "keyMeanings": [
      "Closure and Finality: Tied energy has reached its endpoint. A cycle of effort, a relationship, or a particular obligation is coming to a definitive conclusion, and its results are becoming clear.",
      "Sacred Obligation: A contract must be honored—or ended with care. This refers to commitments, whether spoken or unspoken, that require fulfillment or a conscious, respectful process of dissolution if they are no longer serving their purpose.",
      "Mastery Through Boundaries: Limits clarify power. Understanding and working within defined structures and responsibilities can lead to greater focus, efficiency, and the development of true capability and strength.",
      "Fated Resolution: Karmic threads are being woven or cut. Events unfold that seem destined, bringing resolution to long-standing issues or patterns, often reflecting the natural consequences of past actions and choices."
    ],
    "baseElement": "Spirit",
    "planetExternalDomain": "Saturn – responsibility, karmic patterns, mastery through boundaries.",
    "astrologyInternalInfluence": "Capricorn – structure, long-term goals, integrity.",
    "iconSymbol": "Hourglass",
    "orientation": "Knot Away",
    "sacredGeometry": "Infinity Symbol",
    "synergisticElement": "Spirit"
  },
  {
    "id": "9-Stone",
    "number": "9",
    "suit": "Stone",
    "fullTitle": "9 Stone - The Stone of Witness and Completion",
    "symbols": [
      { "key": "Number", "value": "9" },
      { "key": "Suit", "value": "Stone" },
      { "key": "Element (Base)", "value": "Air" },
      { "key": "Planet (Internal Influence)", "value": "Mars – assertion, willpower, protection." },
      {
        "key": "Astrology (External Domain)",
        "value": "Aries – courageous movement, initiating closure, leading through resolve."
      },
      { "key": "Icon", "value": "pentagon" },
      { "key": "Orientation", "value": "Smooth Side" },
      { "key": "Sacred Geometry", "value": "Eye" },
      { "key": "Synergistic Element", "value": "Earth" }
    ],
    "symbolismBreakdown": [
      "Number: 9 – Completion, spiritual wisdom, closure. Represents the culmination of a cycle, attainment, humanitarianism, and the wisdom gained from a full spectrum of experiences. It is a prelude to a new beginning.",
      "Suit (Stone): The physical, ritual witness, the stone of remembrance. The stone here acts as a monument to what has been experienced and learned, a tangible marker of the journey's end and the wisdom consolidated.",
      "Icon (Eye): The eye represents watchful presence and inner vision, symbolizing the power of sacred attention to bear witness to endings and new beginnings. It implies clear perception, wisdom, and impartial observation. (Original: pentagon, changed to Eye to match Sacred Geometry and theme of witness)",
      "Orientation (Smooth Side): Completion and ease—what has been shaped can now be released. The polished side of the stone indicates that the work is done, the lessons learned, and there's a sense of peace and fulfillment in the accomplishment.",
      "Sacred Geometry (Eye): Symbol of clear knowing, sacred witness, and divine attention. The Eye of Providence or the inner eye signifies enlightenment, spiritual awareness, and the ability to see things as they truly are, with profound understanding.",
      "Planet (Mars): Brings energy to assert finality or protection. Mars provides the courage and drive to definitively conclude matters, protect the wisdom gained, and make any necessary assertive moves to ensure a clean ending.",
      "Astrology (Aries): Direct action, courage, and leadership in ending cycles. Aries initiates with boldness. In the context of 9, this energy is applied to courageously finalize a chapter, leading the way towards resolution and preparing for new ventures.",
      "Synergistic Element (Earth): Where Air unveils patterns and possibilities, Earth gives those patterns substance—turning vision into ritual, ideas into foundations, and fleeting clarity into enduring wisdom. Earth grounds the insights (Air) into tangible, lasting understanding and solidifies the completion."
    ],
    "keyMeanings": [
      "Completion With Honor: What was built can now be let go. Acknowledge accomplishments and the end of a significant phase with grace and integrity, releasing attachments to allow for future growth.",
      "Witness to the Journey: Acknowledge what has been seen and learned. Reflect upon the entire cycle, integrating the lessons and insights gained. This is a time for deep understanding and acceptance of the path traveled.",
      "Spiritual Protection: Guard sacred truths and endings. Preserve the wisdom acquired and ensure that the closure process is respected, protecting the sanctity of what has been completed from negativity or disruption.",
      "Release With Awareness: Let go, but let it teach you. Consciously release people, situations, or beliefs that are part of the concluding cycle, doing so with an understanding of their role in your growth and carrying the lessons forward."
    ],
    "baseElement": "Air",
    "planetExternalDomain": "Mars – assertion, willpower, protection.",
    "astrologyInternalInfluence": "Aries – courageous movement, initiating closure, leading through resolve.",
    "iconSymbol": "pentagon",
    "orientation": "Smooth Side",
    "sacredGeometry": "Eye",
    "synergisticElement": "Earth"
  },
  {
    "id": "10-Cauldron",
    "number": "10",
    "suit": "Cauldron",
    "fullTitle": "10 Cauldron - The Cauldron of Wholeness",
    "symbols": [
      { "key": "Number", "value": "10" },
      { "key": "Suit", "value": "Cauldron" },
      { "key": "Element (Base)", "value": "Water" },
      { "key": "Planet (External Domain)", "value": "Sun – vitality, self-expression, conscious will." },
      { "key": "Astrology (Internal Influence)", "value": "Leo – creativity, leadership, inner radiance." },
      { "key": "Icon", "value": "cauldron" },
      { "key": "Orientation", "value": "Overflowing" },
      { "key": "Sacred Geometry", "value": "Flower of Life" },
      { "key": "Synergistic Element", "value": "Spirit" }
    ],
    "symbolismBreakdown": [
      "Number: 10 – Completion, fulfillment, new cycle. Represents the culmination of a journey and the beginning of another, signifying mastery and the integration of all lessons.",
      "Suit (Cauldron): The vessel of transformation, creation, and spiritual nourishment. The cauldron symbolizes the womb of creation, where disparate elements are combined and transformed into something new and potent.",
      "Icon (Cauldron): A symbol of creation, transformation, and spiritual nourishment. It represents the alchemical process of turning raw potential into manifest reality.",
      "Orientation (Overflowing): Abundance, generosity, boundless potential. The cauldron is full and spilling over, indicating a state of complete fulfillment, where blessings are shared and new possibilities emerge.",
      "Sacred Geometry (Flower of Life): Interconnectedness, divine blueprint, universal harmony. The Flower of Life symbolizes the fundamental patterns of creation, representing the unity of all things and the perfection of existence.",
      "Planet (Sun): The source of vitality, self-expression, and conscious will. The Sun illuminates, brings life, and represents the core self, encouraging bold and authentic creation.",
      "Astrology (Leo): Reflects themes of creativity, leadership, and inner radiance. Leo embodies the courage to express oneself, to lead with heart, and to shine brightly in one's endeavors.",
      "Synergistic Element (Spirit): Spirit enhances the cauldron's wholeness by infusing it with divine wisdom, universal connection, and the understanding of interconnectedness. It facilitates the integration of all aspects of self into a unified whole."
    ],
    "keyMeanings": [
      "Complete Fulfillment: Reaching a state of profound satisfaction. This signifies the culmination of a significant cycle, where all efforts come to fruition, bringing a deep sense of accomplishment and inner peace.",
      "Abundant Blessings: Receiving the fruits of your labor. This points to a period of prosperity and overflowing resources, where your hard work is rewarded, and you have more than enough to share.",
      "Wholeness Achieved: Integrating all aspects of self. This calls for a recognition of your complete being, embracing both your strengths and vulnerabilities, leading to a profound sense of inner harmony and self-acceptance.",
      "New Cycle Begins: A natural conclusion leading to fresh opportunities. This signifies the end of one journey and the start of another, where you carry the wisdom of your past into a new phase of growth and creation.",
      "Generosity and Sharing: Extending your abundance to others. This emphasizes the importance of sharing your blessings, wisdom, and resources with your community, fostering a cycle of giving and receiving."
    ],
    "baseElement": "Water",
    "planetExternalDomain": "Sun – vitality, self-expression, conscious will.",
    "astrologyInternalInfluence": "Leo – creativity, leadership, inner radiance.",
    "iconSymbol": "cauldron",
    "orientation": "Overflowing",
    "sacredGeometry": "Flower of Life",
    "synergisticElement": "Spirit"
  }
]
