[
  {
    "id": "0-Cauldron",
    "number": "0",
    "suit": "Cauldron",
    "fullTitle": "0 Cauldron – The Cauldron of Creation",
    "symbols": [
      {
        "key": "Number",
        "value": "0"
      },
      {
        "key": "Suit",
        "value": "Cauldron"
      },
      {
        "key": "Element (Base)",
        "value": "Spirit"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Pluto – deep transformation, inner renewal, and hidden power."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Scorpio – cycles of death and rebirth, secrets, intensity."
      },
      {
        "key": "Icon",
        "value": "Pentagram"
      },
      {
        "key": "Orientation",
        "value": "Cooking"
      },
      {
        "key": "Sacred Geometry",
        "value": "Dot"
      },
      {
        "key": "Synergistic Element",
        "value": "Fire"
      }
    ],
    "symbolismBreakdown": [
      "Number: 0 – Symbol of unmanifest potential—the infinite womb of all creation, representing the void from which all possibilities emerge, a state of pure being before differentiation. It is the alpha and omega, containing everything and nothing simultaneously.",
      "Suit (Cauldron): In its cooking orientation, the cauldron stews possibility into reality, slowly combining all elements into creation. This signifies a gentle, nurturing, alchemical process where diverse ingredients (experiences, energies, ideas) are patiently blended and transmuted into a new, unified whole.",
      "Icon (Pentagram): Represents balance of the five elements—earth (stability, form), air (intellect, communication), fire (energy, action), water (emotion, intuition), and spirit (life force, connection to the divine). It symbolizes integration, protection, and the perfected human in harmony with the cosmos.",
      "Orientation (Cooking): Emphasizes the active, transformative process of creation. The cauldron is not merely holding ingredients but actively blending and heating them, signifying a period of gestation and alchemical change where potential is being cooked into form.",
      "Sacred Geometry (Dot): The primordial point, the origin of all things, representing unity, wholeness, and the unmanifested potential from which all forms emerge. It is the seed of creation, containing infinite possibilities within itself.",
      "Planet (Pluto): Governs deep transformation, inner renewal, and hidden power. Pluto's influence here suggests that creation often arises from profound internal shifts, a shedding of the old to make way for the new, and tapping into subconscious reserves of power.",
      "Astrology (Scorpio): Associated with cycles of death and rebirth, secrets, and intensity. Scorpio's energy aligns with the cauldron's transformative nature, indicating that creation may involve intense emotional or psychological processes, leading to profound regeneration.",
      "Synergistic Element (Fire): Fire and Spirit igniting the fires of birth and radiant will. This highlights the pure, active, and enthusiastic energy that fuels manifestation, transforming divine inspiration (Spirit) into passionate, visible action."
    ],
    "keyMeanings": [
      "Unmanifest Potential: The void from which all possibilities emerge. This is a state of pure potentiality, where everything is possible but nothing is yet defined. It's the fertile ground for new beginnings.",
      "Alchemical Transformation: Patiently blending and transmuting elements into a new whole. This signifies a process of deep change, where diverse experiences and energies are combined to create something entirely new and unified.",
      "Primordial Origin: The seed of creation, containing infinite possibilities. This points to the fundamental source of all existence, reminding us that even the grandest creations begin from a single, potent point.",
      "Profound Renewal: Creation arises from deep internal shifts and shedding the old. This emphasizes that true creation often requires letting go of outdated forms or beliefs, allowing for a powerful regeneration from within."
    ],
    "baseElement": "Spirit",
    "planetInternalInfluence": "Pluto – deep transformation, inner renewal, and hidden power.",
    "astrologyExternalDomain": "Scorpio – cycles of death and rebirth, secrets, intensity.",
    "iconSymbol": "Pentagram",
    "orientation": "Cooking",
    "sacredGeometry": "Dot",
    "synergisticElement": "Fire",
    "imageFileName": "00-cauldron-spirit.jpg"
  },
  {
    "id": "1-Cauldron",
    "number": "1",
    "suit": "Cauldron",
    "fullTitle": "1 Cauldron – The Cauldron of Manifestation",
    "symbols": [
      {
        "key": "Number",
        "value": "1"
      },
      {
        "key": "Suit",
        "value": "Cauldron"
      },
      {
        "key": "Element (Base)",
        "value": "Fire"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Sun – creative force, willpower, and illumination."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Leo – pride in expression, creative passion, dramatic emergence."
      },
      {
        "key": "Icon",
        "value": "Pentagram"
      },
      {
        "key": "Orientation",
        "value": "Pouring"
      },
      {
        "key": "Sacred Geometry",
        "value": "Plus Sign"
      },
      {
        "key": "Synergistic Element",
        "value": "Fire"
      }
    ],
    "symbolismBreakdown": [
      "Number: 1 – The spark of initiation, singular focus, and the beginning of action. Represents new beginnings, leadership, independence, and the raw energy of creation. It's about stepping forward and asserting one's will.",
      "Suit (Cauldron): In its pouring orientation, the cauldron actively releases its contents into the world, signifying the tangible output of creative energy. This is about bringing ideas, emotions, or intentions into manifest form, sharing the fruits of inner work.",
      "Icon (Pentagram): Represents balance of the five elements—earth (stability, form), air (intellect, communication), fire (energy, action), water (emotion, intuition), and spirit (life force, connection to the divine). It symbolizes integration, protection, and the perfected human in harmony with the cosmos.",
      "Orientation (Pouring): Emphasizes the active release and externalization of creative energy. The cauldron is no longer just brewing but actively dispensing, signifying the moment when inner work translates into outward expression and tangible results.",
      "Sacred Geometry (Plus Sign): Symbolizes active creation, expansion, and the intersection of spiritual and material realms. It represents the addition of energy, growth, and the point where different forces come together to create something new.",
      "Planet (Sun): Represents creative force, willpower, and illumination. The Sun's influence here highlights the conscious, radiant energy driving manifestation, bringing vitality, clarity, and a strong sense of self to the creative process.",
      "Astrology (Leo): Associated with pride in expression, creative passion, and dramatic emergence. Leo's energy aligns with the active, outward nature of the cauldron, encouraging bold self-expression and a confident display of one's unique creations.",
      "Synergistic Element (Fire): Fire and Spirit igniting the fires of birth and radiant will. This highlights the pure, active, and enthusiastic energy that fuels manifestation, transforming divine inspiration (Spirit) into passionate, visible action."
    ],
    "keyMeanings": [
      "Manifestation in Motion: Pour your energy into the world. This is a call to take deliberate action, to channel your creative forces and intentions into tangible outcomes and share your unique contributions.",
      "Personal Power: Lead the creation with your fire. Embrace your innate abilities, willpower, and passion to direct the course of your creations. Own your strength and capacity to make an impact.",
      "Creative Expression: Let your gifts be seen. Do not hide your talents or insights. This is the time to showcase what you have developed, to perform, to publish, to share your unique voice.",
      "Action-Oriented: Time to execute what you've been envisioning. Move beyond planning and dreaming into the realm of doing. Take the necessary steps to bring your visions into reality."
    ],
    "baseElement": "Fire",
    "planetInternalInfluence": "Sun – creative force, willpower, and illumination.",
    "astrologyExternalDomain": "Leo – pride in expression, creative passion, dramatic emergence.",
    "iconSymbol": "Pentagram",
    "orientation": "Pouring",
    "sacredGeometry": "Plus Sign",
    "synergisticElement": "Fire",
    "imageFileName": "01-cauldron-fire.jpg"
  },
  {
    "id": "2-Sword",
    "number": "2",
    "suit": "Sword",
    "fullTitle": "2 Sword - The Sword of Precision and Perception",
    "symbols": [
      {
        "key": "Number",
        "value": "2"
      },
      {
        "key": "Suit",
        "value": "Sword"
      },
      {
        "key": "Element (Base)",
        "value": "Water"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Moon – intuition, reflection, inner perception."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Cancer – emotional depth, nurturing, protective instincts."
      },
      {
        "key": "Icon",
        "value": "Direction Arrows"
      },
      {
        "key": "Orientation",
        "value": "Point First"
      },
      {
        "key": "Sacred Geometry",
        "value": "Chevron"
      },
      {
        "key": "Synergistic Element",
        "value": "Air"
      }
    ],
    "symbolismBreakdown": [
      "Number: 2 – Balance, duality, partnership, and choice. Represents the need for discernment, cooperation, and the weighing of options. It often signifies a decision point or a need for harmony.",
      "Suit (Sword): A symbol of intellect, truth, and discernment. The sword cuts through illusion, representing clarity of thought, decisive action, and the pursuit of truth, even if it's painful.",
      "Icon (Direction Arrows): Suggests attunement to inner guidance through movement. The arrows here point towards a path revealed by intuition, indicating that action should follow the subtle cues and internal compass.",
      "Orientation (Point First): Directs action guided by feeling and subtle knowing. The spear is aimed with precision, but that precision comes from a deep, intuitive sense of rightness rather than purely logical deduction.",
      "Sacred Geometry (Chevron): Represents movement, direction, and progression. The chevron indicates a path forward, often with a sense of clarity and purpose, guiding one towards a specific goal or understanding.",
      "Planet (Moon): Governs intuition, reflection, and inner perception. The Moon's influence here emphasizes that true precision comes from deep introspection and trusting one's inner knowing, rather than solely relying on external logic.",
      "Astrology (Cancer): Associated with emotional depth, nurturing, and protective instincts. Cancer's energy aligns with the intuitive aspect of the sword, suggesting that discernment can be guided by empathy and a desire to protect what is sacred.",
      "Synergistic Element (Air): Where Water flows with intuition, Air provides the clarity to articulate and apply those insights. Air (intellect, communication) sharpens the emotional truths (Water), allowing for precise understanding and expression."
    ],
    "keyMeanings": [
      "Intuitive Discernment: Trust your inner knowing to cut through illusion. This is about relying on your gut feelings and subtle perceptions to make clear, precise decisions, especially when faced with ambiguity or deception.",
      "Emotional Clarity: See the truth of your feelings without judgment. This encourages an honest and direct confrontation with your emotional landscape, allowing you to understand and process feelings without being overwhelmed by them.",
      "Fluid Precision: Act on subtle truths with clarity and compassion. Combine the sharpness of insight with a gentle, understanding approach. This means being decisive when intuition is clear, yet always acting with kindness and empathy."
    ],
    "baseElement": "Water",
    "planetInternalInfluence": "Moon – intuition, reflection, inner perception.",
    "astrologyExternalDomain": "Cancer – emotional depth, nurturing, protective instincts.",
    "iconSymbol": "Direction Arrows",
    "orientation": "Point First",
    "sacredGeometry": "Chevron",
    "synergisticElement": "Air",
    "imageFileName": "02-sword-water.jpg"
  },
  {
    "id": "3-Cord",
    "number": "3",
    "suit": "Cord",
    "fullTitle": "3 Cord - The Cord of Connection and Growth",
    "symbols": [
      {
        "key": "Number",
        "value": "3"
      },
      {
        "key": "Suit",
        "value": "Cord"
      },
      {
        "key": "Element (Base)",
        "value": "Air"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Mercury – communication, intellect, and adaptability."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Gemini – versatility, curiosity, social connection."
      },
      {
        "key": "Icon",
        "value": "Knot"
      },
      {
        "key": "Orientation",
        "value": "Knot Before"
      },
      {
        "key": "Sacred Geometry",
        "value": "Triangle"
      },
      {
        "key": "Synergistic Element",
        "value": "Earth"
      }
    ],
    "symbolismBreakdown": [
      "Number: 3 – Creativity, expression, and synthesis. Represents growth, communication, and the bringing together of different elements to form a new whole. It often signifies expansion and joyful interaction.",
      "Suit (Cord): A symbol of connection, binding, and destiny. The cord represents relationships, agreements, and the threads that weave through life, linking individuals and events. It implies interdependence and shared purpose.",
      "Icon (Knot): Symbolizes the intertwining of energies, ideas, or relationships. The knot represents a strong bond, a point of convergence, or a complex situation that requires careful unraveling or strengthening.",
      "Orientation (Knot Before): Emphasizes the importance of established connections and agreements as a foundation for progress. The knot, being at the forefront, signifies that existing bonds or commitments are primary and must be honored before moving forward.",
      "Sacred Geometry (Triangle): Represents creation, manifestation, and the divine trinity. The triangle symbolizes balance, harmony, and the dynamic interplay of forces that lead to new forms and understandings.",
      "Planet (Mercury): Governs communication, intellect, and adaptability. Mercury's influence here highlights the mental and communicative aspects of connection, suggesting that clear understanding and flexible interaction are key to fostering strong bonds.",
      "Astrology (Gemini): Associated with versatility, curiosity, and social connection. Gemini's energy aligns with the cord's theme of relationships, encouraging open dialogue, diverse interactions, and a playful approach to connecting with others.",
      "Synergistic Element (Earth): Where Air provides the ideas and connections, Earth grounds them into tangible reality. Earth (stability, form) gives substance to the communicative threads (Air), turning fleeting interactions into lasting bonds and concrete agreements."
    ],
    "keyMeanings": [
      "Intertwined Growth: Connections are fostering new developments. This signifies that your relationships, collaborations, or existing agreements are actively contributing to your expansion and the emergence of new possibilities.",
      "Foundation of Agreement: Established bonds are key to moving forward. Before embarking on new ventures, ensure that your existing commitments and relationships are solid and aligned, as they provide the necessary support.",
      "Communicative Flow: Open dialogue strengthens the threads of destiny. This encourages clear, honest, and adaptable communication within your connections, recognizing that words and ideas are powerful tools for shaping shared paths.",
      "Harmonious Synthesis: Bringing diverse elements together for a new whole. This is about finding balance and unity amidst different perspectives or energies, creating something greater than the sum of its parts through collaboration."
    ],
    "baseElement": "Air",
    "planetInternalInfluence": "Mercury – communication, intellect, and adaptability.",
    "astrologyExternalDomain": "Gemini – versatility, curiosity, social connection.",
    "iconSymbol": "Knot",
    "orientation": "Knot Before",
    "sacredGeometry": "Triangle",
    "synergisticElement": "Earth",
    "imageFileName": "03-cord-air.jpg"
  },
  {
    "id": "4-Spear",
    "number": "4",
    "suit": "Spear",
    "fullTitle": "4 Spear - The Spear of Drive and Direction",
    "symbols": [
      {
        "key": "Number",
        "value": "4"
      },
      {
        "key": "Suit",
        "value": "Spear"
      },
      {
        "key": "Element (Base)",
        "value": "Earth"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Uranus – revolution, innovation, and personal awakening."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Aquarius – humanitarian focus, idealism, breaking tradition."
      },
      {
        "key": "Icon",
        "value": "Direction Arrows"
      },
      {
        "key": "Orientation",
        "value": "Shaft First"
      },
      {
        "key": "Sacred Geometry",
        "value": "Ladder"
      },
      {
        "key": "Synergistic Element",
        "value": "Air"
      }
    ],
    "symbolismBreakdown": [
      "Number: 4 – Stability, foundation, the four corners of effort and space. Represents structure, order, practicality, and the establishment of a solid base. It's about building something lasting and reliable.",
      "Suit (Spear): A symbol of forward movement and protection through assertion. The spear is a tool for focused intention, direct action, and defending one's position or goals. It implies courage and a clear aim.",
      "Icon (Direction Arrows): Symbolizes the many directions our focus and purpose can take. This highlights choices in path, the ability to aim with precision, and the dynamic nature of pursuing goals. It can also mean clear guidance.",
      "Orientation (Shaft First): Emphasizes the need to develop stable momentum and a strong inner stance. Before the spearpoint finds its mark, the shaft provides balance, power, and controlled direction, signifying thorough preparation and a solid core.",
      "Sacred Geometry (Ladder): Represents ascension through structured effort. The ladder is a symbol of step-by-step progress, connecting different levels of understanding or achievement. Each rung is a necessary stage in the upward journey.",
      "Planet (Uranus): Brings disruptive insight and personal change. Uranus challenges the status quo with sudden breakthroughs, innovative ideas, and a call for freedom and authenticity, often leading to unexpected shifts in direction.",
      "Astrology (Aquarius): Connects external breakthroughs to idealistic purpose. Aquarius champions progress, humanitarianism, and unconventional thinking, seeking to apply innovative solutions for the betterment of the collective.",
      "Synergistic Element (Air): Fire combined with Air creates movement, clarity, and momentum. Air (intellect, communication) fans the flames of Fire (action, drive), providing strategic thinking and clear articulation to propel initiatives forward. (Note: Element (Base) is Earth, Synergistic is Air, with Fire mentioned. The core idea is Air's contribution to drive.)"
    ],
    "keyMeanings": [
      "Drive With Vision: Structured energy moving toward an ideal. This combines passionate motivation with a clear, well-defined goal and a practical plan, ensuring that effort is applied effectively and purposefully.",
      "Foundation for Action: Building what will carry the force forward. Before launching an initiative, it's crucial to establish a stable base, gather resources, and create the necessary support structures to sustain momentum.",
      "Revolutionary Roots: A new direction built on idealism and truth. This encourages breaking from outdated norms if necessary, guided by a strong sense of purpose and a commitment to authentic, progressive ideals.",
      "Strategic Advancement: A call to ground your inspiration into method. Inspiration needs a practical plan. This is about transforming visionary ideas into actionable steps and methodical execution to achieve tangible results."
    ],
    "baseElement": "Earth",
    "planetInternalInfluence": "Uranus – revolution, innovation, and personal awakening.",
    "astrologyExternalDomain": "Aquarius – humanitarian focus, idealism, breaking tradition.",
    "iconSymbol": "Direction Arrows",
    "orientation": "Shaft First",
    "sacredGeometry": "Ladder",
    "synergisticElement": "Air",
    "imageFileName": "04-spear-earth.jpg"
  },
  {
    "id": "5-Sword",
    "number": "5",
    "suit": "Sword",
    "fullTitle": "5 Sword - The Sword of Power and Conflict",
    "symbols": [
      {
        "key": "Number",
        "value": "5"
      },
      {
        "key": "Suit",
        "value": "Sword"
      },
      {
        "key": "Element (Base)",
        "value": "Fire"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Mars – assertion, willpower, protection."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Aries – courageous movement, initiating closure, leading through resolve."
      },
      {
        "key": "Icon",
        "value": "pentagon"
      },
      {
        "key": "Orientation",
        "value": "Edge First"
      },
      {
        "key": "Sacred Geometry",
        "value": "Eye"
      },
      {
        "key": "Synergistic Element",
        "value": "Spirit"
      }
    ],
    "symbolismBreakdown": [
      "Number: 5 – Change, freedom, and dynamic energy. Represents disruption, adventure, and the need for adaptability. It often signifies a turning point or a challenge that requires courage.",
      "Suit (Sword): A symbol of intellect, truth, and discernment. The sword cuts through illusion, representing clarity of thought, decisive action, and the pursuit of truth, even if it's painful.",
      "Icon (Pentagon): Represents the five elements in dynamic interplay, symbolizing balance, protection, and the human experience. In the context of conflict, it can signify the need to find equilibrium amidst opposing forces.",
      "Orientation (Edge First): Emphasizes direct confrontation and the sharp reality of truth. The sword's edge leading signifies a need for decisive action, cutting through ambiguity, and facing challenges head-on, even if it means conflict.",
      "Sacred Geometry (Eye): The eye represents watchful presence and inner vision, symbolizing the power of sacred attention to bear witness to endings and new beginnings. It implies clear perception, wisdom, and impartial observation. (Original: pentagon, changed to Eye to match Sacred Geometry and theme of witness)",
      "Planet (Mars): Brings energy to assert finality or protection. Mars provides the courage and drive to definitively conclude matters, protect the wisdom gained, and make any necessary assertive moves to ensure a clean ending.",
      "Astrology (Aries): Direct action, courage, and leadership in ending cycles. Aries initiates with boldness. In the context of 9, this energy is applied to courageously finalize a chapter, leading the way towards resolution and preparing for new ventures.",
      "Synergistic Element (Spirit): Where Fire provides the raw power, Spirit gives it purpose and direction. Spirit (life force, divine connection) guides the assertive energy (Fire), ensuring that conflict leads to meaningful transformation and higher understanding."
    ],
    "keyMeanings": [
      "Confrontational Truth: Face challenges directly with courage. This is about having the bravery to address difficult situations, speak uncomfortable truths, and engage in necessary conflicts to achieve clarity and progress.",
      "Dynamic Change: Embrace disruption as a catalyst for growth. This signifies a period where established norms are challenged, leading to new perspectives and opportunities for significant personal or collective evolution.",
      "Assertive Willpower: Use your inner strength to overcome obstacles. This encourages drawing upon your inherent power and determination to navigate through opposition, asserting your boundaries and convictions.",
      "Purposeful Conflict: Conflict can lead to deeper understanding. Recognize that disagreements or struggles, when approached with intention, can reveal hidden truths and foster profound insights, ultimately leading to resolution."
    ],
    "baseElement": "Fire",
    "planetInternalInfluence": "Mars – assertion, willpower, protection.",
    "astrologyExternalDomain": "Aries – courageous movement, initiating closure, leading through resolve.",
    "iconSymbol": "pentagon",
    "orientation": "Edge First",
    "sacredGeometry": "Eye",
    "synergisticElement": "Spirit",
    "imageFileName": "05-sword-fire.jpg"
  },
  {
    "id": "6-Stone",
    "number": "6",
    "suit": "Stone",
    "fullTitle": "6 Stone - The Stone of Harmony and Choice",
    "symbols": [
      {
        "key": "Number",
        "value": "6"
      },
      {
        "key": "Suit",
        "value": "Stone"
      },
      {
        "key": "Element (Base)",
        "value": "Water"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Venus – love, harmony, and aesthetic appreciation."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Libra – balance, justice, partnership, diplomacy."
      },
      {
        "key": "Icon",
        "value": "Heart"
      },
      {
        "key": "Orientation",
        "value": "Smooth Side"
      },
      {
        "key": "Sacred Geometry",
        "value": "Hexagon"
      },
      {
        "key": "Synergistic Element",
        "value": "Earth"
      }
    ],
    "symbolismBreakdown": [
      "Number: 6 – Harmony, responsibility, and nurturing. Represents balance, service, and the need to make choices that align with one's values and relationships. It often signifies domestic bliss and community.",
      "Suit (Stone): The physical, ritual witness, the stone of remembrance. The stone here acts as a monument to what has been experienced and learned, a tangible marker of the journey's end and the wisdom consolidated.",
      "Icon (Heart): Symbolizes love, compassion, and emotional connection. The heart represents the core of one's being, the seat of emotions, and the capacity for deep empathy and nurturing relationships.",
      "Orientation (Smooth Side): Completion and ease—what has been shaped can now be released. The polished side of the stone indicates that the work is done, the lessons learned, and there's a sense of peace and fulfillment in the accomplishment.",
      "Sacred Geometry (Hexagon): Represents harmony, balance, and perfect structure. The hexagon symbolizes the integration of opposing forces, creating a stable and unified whole, often seen in natural patterns like honeycomb.",
      "Planet (Venus): Governs love, harmony, and aesthetic appreciation. Venus's influence here highlights the importance of beauty, connection, and finding equilibrium in relationships and personal choices.",
      "Astrology (Libra): Associated with balance, justice, partnership, and diplomacy. Libra's energy aligns with the stone's theme of harmony and choice, emphasizing the need for fairness, cooperation, and thoughtful decision-making in relationships.",
      "Synergistic Element (Earth): Where Water provides emotional depth, Earth grounds it into tangible stability. Earth (stability, form) gives substance to the emotional currents (Water), turning fleeting feelings into lasting bonds and concrete expressions of care."
    ],
    "keyMeanings": [
      "Balanced Choices: Decisions made with heart and wisdom. This is about weighing options carefully, considering both emotional and practical aspects, to arrive at choices that foster harmony and well-being.",
      "Nurturing Relationships: Cultivate connections that bring peace. This encourages focusing on relationships that are supportive and reciprocal, fostering an environment of mutual respect, love, and understanding.",
      "Inner Harmony: Find equilibrium within yourself. This signifies a period of integrating different aspects of your being, resolving internal conflicts, and achieving a state of inner peace and contentment.",
      "Manifested Love: Express compassion in tangible ways. This is about translating feelings of love and care into concrete actions, creating a stable and beautiful reality for yourself and those around you."
    ],
    "baseElement": "Water",
    "planetInternalInfluence": "Venus – love, harmony, and aesthetic appreciation.",
    "astrologyExternalDomain": "Libra – balance, justice, partnership, diplomacy.",
    "iconSymbol": "Heart",
    "orientation": "Smooth Side",
    "sacredGeometry": "Hexagon",
    "synergisticElement": "Earth",
    "imageFileName": "06-stone-water.jpg"
  },
  {
    "id": "7-Spear",
    "number": "7",
    "suit": "Spear",
    "fullTitle": "7 Spear – The Spear of Intuition and Service",
    "symbols": [
      {
        "key": "Number",
        "value": "7"
      },
      {
        "key": "Suit",
        "value": "Spear"
      },
      {
        "key": "Element (Base)",
        "value": "Air"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Neptune – dreamlike guidance, spiritual defense, and inner clarity."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Pisces – empathy-driven service, defending those unseen, romantic sensitivity."
      },
      {
        "key": "Icon",
        "value": "Direction Arrows"
      },
      {
        "key": "Orientation",
        "value": "Point First"
      },
      {
        "key": "Sacred Geometry",
        "value": "Chevron"
      },
      {
        "key": "Synergistic Element",
        "value": "Air"
      }
    ],
    "symbolismBreakdown": [
      "Number: 7 – Mystery, inner knowledge, spiritual vision. Represents introspection, analysis, wisdom gained through solitude, and the quest for deeper understanding beyond the mundane. It often signifies a spiritual or intellectual breakthrough.",
      "Suit (Spear): Symbol of proactive force and chosen direction. In the context of 7, the spear's aim is guided by inner wisdom and intuitive insights, directing focused action towards a higher purpose or a more spiritual goal.",
      "Icon (Direction Arrows): Suggests attunement to inner guidance through movement. The arrows here point towards a path revealed by intuition, indicating that action should follow the subtle cues and internal compass.",
      "Orientation (Point First): Directs action guided by feeling and subtle knowing. The spear is aimed with precision, but that precision comes from a deep, intuitive sense of rightness rather than purely logical deduction.",
      "Sacred Geometry (Chevron): Represents movement, direction, and progression. The chevron indicates a path forward, often with a sense of clarity and purpose, guiding one towards a specific goal or understanding.",
      "Planet (Neptune): Governs dreamlike guidance, spiritual defense, and inner clarity. Neptune's influence here emphasizes the subtle, intuitive forces that guide one's path, encouraging trust in spiritual insights and compassionate action.",
      "Astrology (Pisces): Associated with empathy-driven service, defending those unseen, and romantic sensitivity. Pisces' energy aligns with the spear's theme of service, suggesting that action can be motivated by deep compassion and a desire to help others, especially those who are vulnerable.",
      "Synergistic Element (Air): Where Air unveils patterns and possibilities, Air also provides the clarity to articulate and apply those insights. Air (intellect, communication) sharpens the intuitive truths, allowing for precise understanding and expression in service."
    ],
    "keyMeanings": [
      "Intuitive Action: Let inner wisdom guide your path. This is about trusting your gut feelings and spiritual insights to direct your efforts, ensuring that your actions are aligned with your higher purpose.",
      "Compassionate Service: Act with empathy for the unseen. This encourages using your abilities to help others, especially those who are marginalized or in need, driven by a deep sense of compassion and understanding.",
      "Spiritual Defense: Protect your inner clarity and truth. This signifies a need to safeguard your spiritual well-being and intuitive perceptions from external noise or negativity, maintaining a clear inner channel.",
      "Dreamlike Guidance: Follow the subtle cues of your soul. This is about being receptive to messages from your subconscious or spiritual realm, allowing them to inform your decisions and lead you towards your true calling."
    ],
    "baseElement": "Air",
    "planetInternalInfluence": "Neptune – dreamlike guidance, spiritual defense, and inner clarity.",
    "astrologyExternalDomain": "Pisces – empathy-driven service, defending those unseen, romantic sensitivity.",
    "iconSymbol": "Direction Arrows",
    "orientation": "Point First",
    "sacredGeometry": "Chevron",
    "synergisticElement": "Air",
    "imageFileName": "07-spear-air.jpg"
  },
  {
    "id": "8-Cord",
    "number": "8",
    "suit": "Cord",
    "fullTitle": "8 Cord – The Cord of Binding and Resolution",
    "symbols": [
      {
        "key": "Number",
        "value": "8"
      },
      {
        "key": "Suit",
        "value": "Cord"
      },
      {
        "key": "Element (Base)",
        "value": "Spirit"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Saturn – responsibility, karmic patterns, mastery through boundaries."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Capricorn – structure, long-term goals, integrity."
      },
      {
        "key": "Icon",
        "value": "Hourglass"
      },
      {
        "key": "Orientation",
        "value": "Knot Away"
      },
      {
        "key": "Sacred Geometry",
        "value": "Infinity Symbol"
      },
      {
        "key": "Synergistic Element",
        "value": "Spirit"
      }
    ],
    "symbolismBreakdown": [
      "Number: 8 – Karmic return, balance of effort, cycles of resolution. Represents cause and effect, power, abundance, and the balancing of material and spiritual realms. It often signifies the consequences of past actions coming to fruition.",
      "Suit (Cord): A symbol of connection, binding, and destiny. The cord represents relationships, agreements, and the threads that weave through life, linking individuals and events. It implies interdependence and shared purpose.",
      "Icon (Hourglass): Symbolizes the passage of time, cycles, and the inevitability of resolution. The hourglass represents the culmination of a process, the winding down of a phase, and the importance of honoring time's flow.",
      "Orientation (Knot Away): Emphasizes the release of old ties and the completion of karmic cycles. The knot moving away signifies a detachment from past obligations or entanglements, allowing for freedom and new beginnings.",
      "Sacred Geometry (Infinity Symbol): Represents endless cycles, eternal flow, and the interconnectedness of all things. The infinity symbol signifies continuous transformation, the balance of opposing forces, and the boundless nature of existence.",
      "Planet (Saturn): Governs responsibility, karmic patterns, and mastery through boundaries. Saturn's influence here highlights the importance of discipline, commitment, and learning from past experiences to achieve lasting resolution.",
      "Astrology (Capricorn): Associated with structure, long-term goals, and integrity. Capricorn's energy aligns with the cord's theme of binding and resolution, encouraging a disciplined approach to fulfilling obligations and building a solid foundation for the future.",
      "Synergistic Element (Spirit): Where Spirit provides the life force and divine connection, Spirit also guides the process of binding and unbinding. Spirit (life force, divine connection) ensures that resolutions are aligned with higher purpose and lead to true liberation."
    ],
    "keyMeanings": [
      "Closure and Finality: Tied energy has reached its endpoint. A cycle of effort, a relationship, or a particular obligation is coming to a definitive conclusion, and its results are becoming clear.",
      "Sacred Obligation: A contract must be honored—or ended with care. This refers to commitments, whether spoken or unspoken, that require fulfillment or a conscious, respectful process of dissolution if they are no longer serving their purpose.",
      "Mastery Through Boundaries: Limits clarify power. Understanding and working within defined structures and responsibilities can lead to greater focus, efficiency, and the development of true capability and strength.",
      "Fated Resolution: Karmic threads are being woven or cut. Events unfold that seem destined, bringing resolution to long-standing issues or patterns, often reflecting the natural consequences of past actions and choices."
    ],
    "baseElement": "Spirit",
    "planetInternalInfluence": "Saturn – responsibility, karmic patterns, mastery through boundaries.",
    "astrologyExternalDomain": "Capricorn – structure, long-term goals, integrity.",
    "iconSymbol": "Hourglass",
    "orientation": "Knot Away",
    "sacredGeometry": "Infinity Symbol",
    "synergisticElement": "Spirit",
    "imageFileName": "08-cord-spirit.jpg"
  },
  {
    "id": "9-Stone",
    "number": "9",
    "suit": "Stone",
    "fullTitle": "9 Stone - The Stone of Witness and Completion",
    "symbols": [
      {
        "key": "Number",
        "value": "9"
      },
      {
        "key": "Suit",
        "value": "Stone"
      },
      {
        "key": "Element (Base)",
        "value": "Air"
      },
      {
        "key": "Planet (Internal Influence)",
        "value": "Mars – assertion, willpower, protection."
      },
      {
        "key": "Astrology (External Domain)",
        "value": "Aries – courageous movement, initiating closure, leading through resolve."
      },
      {
        "key": "Icon",
        "value": "pentagon"
      },
      {
        "key": "Orientation",
        "value": "Smooth Side"
      },
      {
        "key": "Sacred Geometry",
        "value": "Eye"
      },
      {
        "key": "Synergistic Element",
        "value": "Earth"
      }
    ],
    "symbolismBreakdown": [
      "Number: 9 – Completion, spiritual wisdom, closure. Represents the culmination of a cycle, attainment, humanitarianism, and the wisdom gained from a full spectrum of experiences. It is a prelude to a new beginning.",
      "Suit (Stone): The physical, ritual witness, the stone of remembrance. The stone here acts as a monument to what has been experienced and learned, a tangible marker of the journey's end and the wisdom consolidated.",
      "Icon (Eye): The eye represents watchful presence and inner vision, symbolizing the power of sacred attention to bear witness to endings and new beginnings. It implies clear perception, wisdom, and impartial observation. (Original: pentagon, changed to Eye to match Sacred Geometry and theme of witness)",
      "Orientation (Smooth Side): Completion and ease—what has been shaped can now be released. The polished side of the stone indicates that the work is done, the lessons learned, and there's a sense of peace and fulfillment in the accomplishment.",
      "Sacred Geometry (Eye): Symbol of clear knowing, sacred witness, and divine attention. The Eye of Providence or the inner eye signifies enlightenment, spiritual awareness, and the ability to see things as they truly are, with profound understanding.",
      "Planet (Mars): Brings energy to assert finality or protection. Mars provides the courage and drive to definitively conclude matters, protect the wisdom gained, and make any necessary assertive moves to ensure a clean ending.",
      "Astrology (Aries): Direct action, courage, and leadership in ending cycles. Aries initiates with boldness. In the context of 9, this energy is applied to courageously finalize a chapter, leading the way towards resolution and preparing for new ventures.",
      "Synergistic Element (Earth): Where Air unveils patterns and possibilities, Earth gives those patterns substance—turning vision into ritual, ideas into foundations, and fleeting clarity into enduring wisdom. Earth grounds the insights (Air) into tangible, lasting understanding and solidifies the completion."
    ],
    "keyMeanings": [
      "Completion With Honor: What was built can now be let go. Acknowledge accomplishments and the end of a significant phase with grace and integrity, releasing attachments to allow for future growth.",
      "Witness to the Journey: Acknowledge what has been seen and learned. Reflect upon the entire cycle, integrating the lessons and insights gained. This is a time for deep understanding and acceptance of the path traveled.",
      "Spiritual Protection: Guard sacred truths and endings. Preserve the wisdom acquired and ensure that the closure process is respected, protecting the sanctity of what has been completed from negativity or disruption.",
      "Release With Awareness: Let go, but let it teach you. Consciously release people, situations, or beliefs that are part of the concluding cycle, doing so with an understanding of their role in your growth and carrying the lessons forward."
    ],
    "baseElement": "Air",
    "planetInternalInfluence": "Mars – assertion, willpower, protection.",
    "astrologyExternalDomain": "Aries – courageous movement, initiating closure, leading through resolve.",
    "iconSymbol": "pentagon",
    "orientation": "Smooth Side",
    "sacredGeometry": "Eye",
    "synergisticElement": "Earth",
    "imageFileName": "09-stone-air.jpg"
  }
]
